professions_food = [
    'Аппаратчик производства кисломолочных и детских молочных продуктов',
    'Мастер производства молочного сахара',
    'Аппаратчик сгущения молока и другого молочного сырья',
    'Изготовитель сметаны',
    'Изготовитель мороженого',
    'Закальщик мороженого',
    'Изготовитель казеина',
    'Изготовитель творога и творожной массы',
    'Аппаратчик термической обработки колбасных изделий, субпродуктов, мясопродуктов',
    'Оператор термокамер и термоагрегатов',
    'Оператор тепловых/холодильных установок',
    'Оператор в производстве заквасок',
    'Обработчик ветсанбрака',
    'Оператор в производстве кисломолочных и детских молочных продуктов',
    'Обработчик волоса, шерсти и щетины, рогов и шкур',
    'Оператор молокохранилища',
    'Аппаратчик производства сухих молочных продуктов',
    'Приемщик молочной продукции',
    'Сепараторщик молока',
    'Обработчик мясных туш',
    'Маслодел',
    'Оператор автомата по производству полуфабрикатов',
    'Аппаратчик производства плавленого сыра',
    'Наладчик-ремонтник промышленного оборудования в пищевой промышленности',
    'Сыродел',
    'Оператор автомата по производству вареных колбас и сосисок',
    'Коптильщик колбасного сыра',
    'Оператор бутылоразгрузочного и бутылоукладочного автомата',
    'Мастер производства сухого обезжиренного молока и заменителя цельного молока и кисломолочной продукции',
    'Обвальщик мяса',
    'Мастер производства цельномолочной и кисломолочной продукции',
    'Аппаратчик установки для отделения мяса от кости',
]

professions_metallurgy = [
    'Агломератчик',
    'Вальцовщик по сборке и перевалке клетей',
    'Вальцовщик профилегибочного агрегата',
    'Вальцовщик стана горячего проката труб',
    'Вальцовщик стана горячей прокатки',
    'Вальцовщик стана холодного проката труб',
    'Вальцовщик стана холодной прокатки',
    'Вальцовщик холодного металла',
    'Вальцовщик цветных металлов',
    'Водопроводчик доменной печи',
    'Волочильщик',
    'Волочильщик цветных металлов',
    'Газовщик доменной печи',
    'Горновой десульфурации чугуна',
    'Горновой доменной печи',
    'Грануляторщик доменного шлака',
    'Дозировщик агломерационной шихты',
    'Инженер-металлург',
    'Инженер-технолог',
    'Инженер-химик',
    'Катодчик',
    'Конвертерщик',
    'Контролер продукции цветной металлургии',
    'Кузнец-штамповщик',
    'Литейщик',
    'Литейщик металлов и сплавов',
    'Литейщик цветных металлов',
    'Машинист коксовых машин',
    'Машинист разливочной машины',
    'Машинист шихтоподачи',
    'Нагревальщик металла',
    'Нагревальщик цветных металлов',
    'Наладчик холодноштамповочного оборудования',
    'Наладчик-ремонтник промышленного оборудования в металлургии',
    'Обработчик поверхностных пороков металла',
    'Оператор машины непрерывного литья заготовок',
    'Оператор поста управления стана горячей прокатки',
    'Оператор поста управления стана холодной прокатки',
    'Печевой на вельцпечах',
    'Печевой на обжиговых печах',
    'Плавильщик металла и сплавов',
    'Плавильщик ферросплавов',
    'Плавильщик цветных металлов и сплавов',
    'Плакировщик полимерных материалов на металл',
    'Прессовщик',
    'Прокатчик горячего металла',
    'Прокатчик цветных металлов',
    'Разливщик стали',
    'Резчик горячего металла',
    'Резчик термической резки металлов',
    'Резчик труб и заготовок',
    'Резчик холодного металла',
    'Специалист по гидрометаллургическому производству тяжелых цветных металлов',
    'Специалист по кислородно-конвертерному производству стали',
    'Специалист по пирометаллургическому производству тяжелых цветных металлов',
    'Специалист по производству агломерата',
    'Специалист по производству горячего проката',
    'Специалист по производству горячекатаных труб',
    'Специалист по производству кокса',
    'Специалист по производству сварных труб',
    'Специалист по производству холодного проката',
    'Специалист по производству холоднокатаных труб',
    'Специалист по производству чугуна',
    'Специалист по разработке новых конструкционных материалов на основе цветных и черных металлов',
    'Специалист по электросталеплавильному производству',
    'Специалист-технолог участка порошковой металлургии',
    'Сталевар',
    'Сталевар установки внепечной обратотки стали',
    'Сталевар установки внепечной',
    'Термист проката и труб',
    'Чистильщик в металлургии',
    'Чистильщик металла, отливок, изделий и деталей',
    'Шихтовщик',
    'Электролизник водных растворов',
]

professions_media = [
    'Инженер-проектировщик',
    'Инженер-электроник',
    'Инженер технической поддержки',
    'Инженер связи',
    'Ведущий программы',
    'Антенщик-мачтовик',
    'Кабельщик-спайщик',
    'Контролер печатной продукции, полуфабрикатов и материалов',
    'Корреспондент',
    'Наладчик полиграфического оборудования',
    'Оператор связи',
    'Оператор средств массовой информации',
    'Радиооператор (радиотелефонист)',
    'Редактор',
    'Специалист по видеомонтажу',
    'Специалист по обслуживанию телекоммуникаций',
    'Специалист по продвижению и распространению продукции средств массовой информации',
    'Специалист по производству продукции телерадиовещательных средств массовой информации',
    'Специалист почтовой связи',
    'Специалист по радиосвязи и телекоммуникациям',
    'Специалист по производству продукции сетевых изданий и информационных агентств',
    'Специалист по производству продукции печатных средств массовой информации',
    'Телеграфист',
    'Телефонист',
    'Техник-полиграфист',
    'Фотограф',
]
professions = professions_metallurgy

current_year = 2019



from class_profession import profession       

import csv

input_file = csv.DictReader(open('all_vacancies_metallurgy.csv', 'r', encoding = 'UTF-8'))
vacancies = list(input_file)

def full_report():
    number = 1
    for x in professions:
        prof = profession(x, vacancies)
        no_vacs = True
        for x in prof.q_data:
            if x.num_vacs != 0:
                no_vacs = False
        if no_vacs == True:
            continue
        prof.report(number)
        number += 1

def srez_report():
    for index in range(4):
        print(F'Срез {index + 1}-го квартала')
        for x in professions:
            profession(x, vacancies).qvartal_report_num_vacs(index)
        print()

srez_report()